#### BuiltInFailures.TextFailures Members

---

|  |
| --- |
| BuiltInFailures TextFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures TextFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCreateModeltext | Can't create Model Text. |
| Public property Static member | ModeltextIsEmpty | Model Text deleted because it consists entirely of spaces and/or carriage returns. |

# See Also

BuiltInFailures TextFailures Class

Autodesk.Revit.DB Namespace